01/1.1.org
#+property: header-args :exports both :eval no-export :session
#+options: tex:dvipng
#+latex: \setcounter{secnumdepth}{0}

* 1.1 The Elements of Programming
** Exercise 1.1
*** Question
Below is a sequence of expressions. What is
the result printed by the interpreter in response to each
expression? Assume that the sequence is to be evaluated in
the order in which it is presented.
#+begin_src scheme :eval no
10
(+ 5 3 4)
(- 9 1)
(/ 6 2)
(+ (* 2 4) (- 4 6))
(define a 3)
(define b (+ a 1))
(+ a b (* a b))
(= a b)
(if (and (> b a) (< b (* a b)))
    b
    a)

(cond ((= a 4) 6)
      ((= b 4) (+ 6 7 a))
      (else 25))
(+ 2 (if (> b a) b a))

(* (cond ((> a b) a)
((< a b) b)
	 (else -1))
   (+ a 1))
#+end_src

*** Answer
#+begin_src scheme
10
#+end_src

#+RESULTS:
: 10

#+begin_src scheme
(+ 5 3 4)
#+end_src

#+RESULTS:
: 12

#+begin_src scheme
(- 9 1)
#+end_src

#+RESULTS:
: 8

#+begin_src scheme
(+ (* 2 4) (- 4 6))
#+end_src

#+RESULTS:
: 6

#+begin_src scheme
(define a 3)
#+end_src

#+RESULTS:
: #<unspecified>

#+begin_src scheme
(define b (+ a 1))
#+end_src

#+RESULTS:
: #<unspecified>

#+begin_src scheme
(+ a b (* a b))
#+end_src

#+RESULTS:
: 19

#+begin_src scheme
(= a b)
#+end_src

#+RESULTS:
: #f

#+begin_src scheme
(if (and (> b a) (< b (* a b)))
    b
    a)
#+end_src

#+RESULTS:
: 4

#+begin_src scheme
(cond ((= a 4) 6)
      ((= b 4) (+ 6 7 a))
      (else 25))
#+end_src

#+RESULTS:
: 16

#+begin_src scheme
(+ 2 (if (> b a) b a))
#+end_src

#+RESULTS:
: 6

#+begin_src scheme
(* (cond ((> a b) a)
	 ((> b a) b)
	 (else -1))
   (+ a 1))
#+end_src

#+RESULTS:
: 16

** Exercise 1.2
*** Question
Translate the following expression into prefix
form:
$$
\frac{5 + 4 + (2 - (3 - (6 + \frac{4}{5})))}
{3(6 - 2) (2 - 7)}.
$$

*** Answer
#+begin_src scheme
(/ (+ 5 4 (- 2 (- 3 (+ 6 (/ 4 5)))))
   (* 3 (- 6 2) (- 2 7)))
#+end_src

#+RESULTS:
: -37/150

** Exercise 1.3
*** Question
Define a procedure that takes three numbers
as arguments and returns the sum of the squares of the two
larger numbers.

*** Answer
#+begin_src scheme
(define (square x) (* x x))

(define (maxsq x y z)
  (square (cond ((> x y) x)
		((> x z) x)
		(else 0))))
	
(define (summaxsq a b c)
  (+ (maxsq a b c)
     (maxsq b a c)
     (maxsq c a b)))
     
(summaxsq 1 2 3)
#+end_src

#+RESULTS:
: 13

** Exercise 1.4
*** Question
Observe that our model of evaluation allows
for combinations whose operators are compound
expressions. Use this observation to describe the behavior of the
following procedure:
#+begin_src scheme :eval no
(define (a-plus-abs-b a b)
  ((if (> b 0) + -) a b))
#+end_src

*** Answer
If ~b~ defined in the parameter of ~a-plus-abs-b~ is greater than 0,
the operator for calculating ~a b~ is $+$,
else it is $-$.

** Exercise 1.5
*** Question
Ben Bitdiddle has invented a test to determine
whether the interpreter he is faced with is using
applicative-order evaluation or normal-order evaluation. He defines the
following two procedures:
#+begin_src scheme :eval no
(define (p) (p))
(define (test x y)
  (if (= x 0) 0 y))
#+end_src
Then he evaluates the expression
#+begin_src scheme :eval no
(test 0 (p))
#+end_src
What behavior will Ben observe with an interpreter that
uses applicative-order evaluation? What behavior will he
observe with an interpreter that uses normal-order
evaluation? Explain your answer. (Assume that the evaluation
rule for the special form if is the same whether the
interpreter is using normal or applicative order: The
predicate expression is evaluated first, and the result determines
whether to evaluate the consequent or the alternative
expression.)

*** Answer
**** Applicative-order Evaluation
First, this expression:
#+begin_src scheme :eval no
(test 0 (p))
#+end_src
evaluates the arguments ~0~ and ~(p)~ first,
which can be seen as ~0~, which is not defined,
and ~(p)~, which is defined as ~(p)~. This can be
seen as:
#+begin_src scheme :eval no
(test (0) (define (p) (p)))
#+end_src
Then, the procedure ~test~ which can be seen as ~(if (= x 0) 0 y)~ is applied,
which applies the evaluated arguments as the procedure arguments. This can be
seen as:
#+begin_src scheme :eval no
(define (test 0 (p))
  (if (= 0 0) 0 (p)))
#+end_src

**** Normal-order Evaluation
First, this expression:
#+begin_src scheme :eval no
(test 0 (p))
#+end_src
substitues the expressions inside until it only involves primitive expressions.
This can be seen as:
#+begin_src scheme :eval no
(define (test 0 (define (p) (p)))
  (if (= 0 0) 0 (p)))
#+end_src
Then only after that the made expressions inside ~test~ are evaluated,
which there is one i.e. ~(define (p) (p))~ then the operands itself. 
This can be seen as:
#+begin_src scheme :eval no
(define (test 0 (p))
  (if (= 0 0) 0 (p)))
#+end_src

** Exercise 1.6
*** Question
Alyssa P. Hacker doesn’t see why if needs to
be provided as a special form. “Why can’t I just define it as
an ordinary procedure in terms of cond?” she asks. Alyssa’s
friend Eva Lu Ator claims this can indeed be done, and she
defines a new version of if:
#+begin_src scheme :eval no
(define (new-if predicate then-clause else-clause)
  (cond (predicate then-clause)
	(else else-clause)))
#+end_src
Eva demonstrates the program for Alyssa:
#+begin_src scheme :eval no
(new-if (= 2 3) 0 5)
#+end_src
#+begin_example
5
#+end_example
#+begin_src scheme :eval no
(new-if (= 1 1) 0 5)
#+end_src
#+begin_example
0
#+end_example
Delighted, Alyssa uses new-if to rewrite the square-root
program:
#+begin_src scheme :eval no
(define (sqrt-iter guess x)
  (new-if (good-enough? guess x)
	  guess
	  (sqrt-iter (improve guess x) x)))
#+end_src
What happens when Alyssa attempts to use this to compute
square roots? Explain.

*** Answer
Since Scheme uses the applicative-order evaluation as mentioned and new-if is a procedure,
the operands will be evaluated first, so ~(sqrt-iter guess x)~ evaluates ~guess~ and ~x~ first.
By doing this,
#+begin_src scheme :eval no
  (new-if (good-enough? guess x)
	  guess
	  (sqrt-iter (improve guess x) x)))
#+end_src
from ~good-enough?~ evaluates ~guess x~ first. Also an operand which is the parent procedure itself there
calls recursively, which creates an infinite recursion because it calls itself every time ~new-if~ is called,
which is its procedure.

** Exercise 1.7
*** Question
The good-enough? test used in computing
square roots will not be very effective for finding the square
roots of very small numbers. Also, in real computers,
arithmetic operations are almost always performed with limited precision.
This makes our test inadequate for very large
numbers. Explain these statements, with examples showing
how the test fails for small and large numbers. An alternative
strategy for implementing ~good-enough?~ is to watch
how guess changes from one iteration to the next and to
stop when the change is a very small fraction of the guess.
Design a square-root procedure that uses this kind of end
test. Does this work better for small and large numbers?

*** Answer
Based on the example in computing square roots:
#+begin_src scheme :exports code
(define (sqrt-iter guess x)
  (if (good-enough? guess x)
      guess
      (sqrt-iter (improve guess x) x)))

(define (improve guess x)
  (average guess (/ x guess)))

(define (average x y)
  (/ (+ x y) 2))

(define (good-enough? guess x)
  (< (abs (- (square guess)
             x))
     0.001))

(define (sqrt x)
  (sqrt-iter 1.0 x))
#+end_src

#+RESULTS:
: #<unspecified>
For small numbers, the function works as intended as shown:
#+begin_src scheme
(sqrt 9)
#+end_src

#+RESULTS:
: 3.00009155413138
However, large numbers like the one shown below:
#+begin_src scheme :eval no
(sqrt 12345678901234)
#+end_src
does not work properly, as the program appears to never end when evaluated.
An alternative strategy for ~good-enough~ as mentioned would be to stop when the change is a very small fraction of ~guess~.
#+begin_src scheme :exports code
(define (good-enough? guess x)
  (< (abs (- guess
             (improve guess x)))
     (/ guess 1000000)))
#+end_src

#+RESULTS:
: #<unspecified>
Using the new function, the program evaluates properly as shown:
#+begin_src scheme
(sqrt 12345678901234)
#+end_src

#+RESULTS:
: 3513641.86446291

** Exercise 1.8
*** Question
Newton’s method for cube roots is based on
the fact that if y is an approximation to the cube root of x,
then a better approximation is given by the value
$$
\frac{x/y^2 + 2y}{3}.
$$
Use this formula to implement a cube-root procedure analogous
to the square-root procedure. (In Section 1.3.4 we will
see how to implement Newton’s method in general as an
abstraction of these square-root and cube-root procedures.)

*** Answer
The formula is implemented into ~cbrt-improve~ where $y$ becomes ~guess~ and $x$ becomes the desired number to evaluate.
#+begin_src scheme :exports code
(define (cbrt-improve guess x)
  (/ (+ (/ x
           (square guess))
        (* 2 guess))
     3))
#+end_src

#+RESULTS:
: #<unspecified>
Then these are the correspondent functions for it:
#+begin_src scheme :exports code 
(define (cbrt-iter guess x)
  (if (cbrt-good-enough? guess x)
      guess
      (cbrt-iter (cbrt-improve guess x) x)))
  
(define (cbrt-good-enough? guess x)
  (< (abs (- guess
             (cbrt-improve guess x)))
     (/ guess 1000000)))

(define (cbrt x)
  (cbrt-iter 1.0 x))
#+end_src

#+RESULTS:
: #<unspecified>
The result of the functions is shown below for the cube root of 64:
#+begin_src scheme
(cbrt 64)
#+end_src

#+RESULTS:
: 4.000000000076121
