01/1.1.tex
% Created 2023-06-03 Sat 22:22
% Intended LaTeX compiler: pdflatex
\documentclass[11pt]{article}
\usepackage[utf8]{inputenc}
\usepackage[T1]{fontenc}
\usepackage{graphicx}
\usepackage{longtable}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage[normalem]{ulem}
\usepackage{amsmath}
\usepackage{amssymb}
\usepackage{capt-of}
\usepackage{hyperref}
\author{alfie}
\date{\today}
\title{}
\hypersetup{
 pdfauthor={alfie},
 pdftitle={},
 pdfkeywords={},
 pdfsubject={},
 pdfcreator={Emacs 28.2 (Org mode 9.6.6)}, 
 pdflang={English}}
\begin{document}

\tableofcontents

\setcounter{secnumdepth}{0}

\section{1.1 The Elements of Programming}
\label{sec:org790a04a}
\subsection{Exercise 1.1}
\label{sec:org6f54a59}
\subsubsection{Question}
\label{sec:org759c482}
Below is a sequence of expressions. What is
the result printed by the interpreter in response to each
expression? Assume that the sequence is to be evaluated in
the order in which it is presented.
\begin{verbatim}
10
(+ 5 3 4)
(- 9 1)
(/ 6 2)
(+ (* 2 4) (- 4 6))
(define a 3)
(define b (+ a 1))
(+ a b (* a b))
(= a b)
(if (and (> b a) (< b (* a b)))
    b
    a)

(cond ((= a 4) 6)
      ((= b 4) (+ 6 7 a))
      (else 25))
(+ 2 (if (> b a) b a))

(* (cond ((> a b) a)
((< a b) b)
         (else -1))
   (+ a 1))
\end{verbatim}

\subsubsection{Answer}
\label{sec:org0bf7fb2}
\begin{verbatim}
10
\end{verbatim}

\begin{verbatim}
10
\end{verbatim}


\begin{verbatim}
(+ 5 3 4)
\end{verbatim}

\begin{verbatim}
12
\end{verbatim}


\begin{verbatim}
(- 9 1)
\end{verbatim}

\begin{verbatim}
8
\end{verbatim}


\begin{verbatim}
(+ (* 2 4) (- 4 6))
\end{verbatim}

\begin{verbatim}
6
\end{verbatim}


\begin{verbatim}
(define a 3)
\end{verbatim}

\begin{verbatim}
#<unspecified>
\end{verbatim}


\begin{verbatim}
(define b (+ a 1))
\end{verbatim}

\begin{verbatim}
#<unspecified>
\end{verbatim}


\begin{verbatim}
(+ a b (* a b))
\end{verbatim}

\begin{verbatim}
19
\end{verbatim}


\begin{verbatim}
(= a b)
\end{verbatim}

\begin{verbatim}
#f
\end{verbatim}


\begin{verbatim}
(if (and (> b a) (< b (* a b)))
    b
    a)
\end{verbatim}

\begin{verbatim}
4
\end{verbatim}


\begin{verbatim}
(cond ((= a 4) 6)
      ((= b 4) (+ 6 7 a))
      (else 25))
\end{verbatim}

\begin{verbatim}
16
\end{verbatim}


\begin{verbatim}
(+ 2 (if (> b a) b a))
\end{verbatim}

\begin{verbatim}
6
\end{verbatim}


\begin{verbatim}
(* (cond ((> a b) a)
         ((> b a) b)
         (else -1))
   (+ a 1))
\end{verbatim}

\begin{verbatim}
16
\end{verbatim}

\subsection{Exercise 1.2}
\label{sec:orgde43b95}
\subsubsection{Question}
\label{sec:org859b0ce}
Translate the following expression into prefix
form:
$$
\frac{5 + 4 + (2 - (3 - (6 + \frac{4}{5})))}
{3(6 - 2) (2 - 7)}.
$$

\subsubsection{Answer}
\label{sec:orgaef6194}
\begin{verbatim}
(/ (+ 5 4 (- 2 (- 3 (+ 6 (/ 4 5)))))
   (* 3 (- 6 2) (- 2 7)))
\end{verbatim}

\begin{verbatim}
-37/150
\end{verbatim}

\subsection{Exercise 1.3}
\label{sec:org59cf48f}
\subsubsection{Question}
\label{sec:org89fa0ad}
Define a procedure that takes three numbers
as arguments and returns the sum of the squares of the two
larger numbers.

\subsubsection{Answer}
\label{sec:org8029dcb}
\begin{verbatim}
(define (square x) (* x x))

(define (maxsq x y z)
  (square (cond ((> x y) x)
                ((> x z) x)
                (else 0))))

(define (summaxsq a b c)
  (+ (maxsq a b c)
     (maxsq b a c)
     (maxsq c a b)))

(summaxsq 1 2 3)
\end{verbatim}

\begin{verbatim}
13
\end{verbatim}

\subsection{Exercise 1.4}
\label{sec:orgdb9dadc}
\subsubsection{Question}
\label{sec:orgce34547}
Observe that our model of evaluation allows
for combinations whose operators are compound
expressions. Use this observation to describe the behavior of the
following procedure:
\begin{verbatim}
(define (a-plus-abs-b a b)
  ((if (> b 0) + -) a b))
\end{verbatim}

\subsubsection{Answer}
\label{sec:org59d3bef}
If \texttt{b} defined in the parameter of \texttt{a-plus-abs-b} is greater than 0,
the operator for calculating \texttt{a b} is \(+\),
else it is \(-\).

\subsection{Exercise 1.5}
\label{sec:org5f86765}
\subsubsection{Question}
\label{sec:org81a1095}
Ben Bitdiddle has invented a test to determine
whether the interpreter he is faced with is using
applicative-order evaluation or normal-order evaluation. He defines the
following two procedures:
\begin{verbatim}
(define (p) (p))
(define (test x y)
  (if (= x 0) 0 y))
\end{verbatim}
Then he evaluates the expression
\begin{verbatim}
(test 0 (p))
\end{verbatim}
What behavior will Ben observe with an interpreter that
uses applicative-order evaluation? What behavior will he
observe with an interpreter that uses normal-order
evaluation? Explain your answer. (Assume that the evaluation
rule for the special form if is the same whether the
interpreter is using normal or applicative order: The
predicate expression is evaluated first, and the result determines
whether to evaluate the consequent or the alternative
expression.)

\subsubsection{Answer}
\label{sec:org086f003}
\begin{enumerate}
\item Applicative-order Evaluation
\label{sec:org0363d8d}
First, this expression:
\begin{verbatim}
(test 0 (p))
\end{verbatim}
evaluates the arguments \texttt{0} and \texttt{(p)} first,
which can be seen as \texttt{0}, which is not defined,
and \texttt{(p)}, which is defined as \texttt{(p)}. This can be
seen as:
\begin{verbatim}
(test (0) (define (p) (p)))
\end{verbatim}
Then, the procedure \texttt{test} which can be seen as \texttt{(if (= x 0) 0 y)} is applied,
which applies the evaluated arguments as the procedure arguments. This can be
seen as:
\begin{verbatim}
(define (test 0 (p))
  (if (= 0 0) 0 (p)))
\end{verbatim}

\item Normal-order Evaluation
\label{sec:org2e3bd4f}
First, this expression:
\begin{verbatim}
(test 0 (p))
\end{verbatim}
substitues the expressions inside until it only involves primitive expressions.
This can be seen as:
\begin{verbatim}
(define (test 0 (define (p) (p)))
  (if (= 0 0) 0 (p)))
\end{verbatim}
Then only after that the made expressions inside \texttt{test} are evaluated,
which there is one i.e. \texttt{(define (p) (p))} then the operands itself. 
This can be seen as:
\begin{verbatim}
(define (test 0 (p))
  (if (= 0 0) 0 (p)))
\end{verbatim}
\end{enumerate}

\subsection{Exercise 1.6}
\label{sec:orgedf1d14}
\subsubsection{Question}
\label{sec:org1f5e5d8}
Alyssa P. Hacker doesn’t see why if needs to
be provided as a special form. “Why can’t I just define it as
an ordinary procedure in terms of cond?” she asks. Alyssa’s
friend Eva Lu Ator claims this can indeed be done, and she
defines a new version of if:
\begin{verbatim}
(define (new-if predicate then-clause else-clause)
  (cond (predicate then-clause)
        (else else-clause)))
\end{verbatim}
Eva demonstrates the program for Alyssa:
\begin{verbatim}
(new-if (= 2 3) 0 5)
\end{verbatim}
\begin{verbatim}
5
\end{verbatim}
\begin{verbatim}
(new-if (= 1 1) 0 5)
\end{verbatim}
\begin{verbatim}
0
\end{verbatim}
Delighted, Alyssa uses new-if to rewrite the square-root
program:
\begin{verbatim}
(define (sqrt-iter guess x)
  (new-if (good-enough? guess x)
          guess
          (sqrt-iter (improve guess x) x)))
\end{verbatim}
What happens when Alyssa attempts to use this to compute
square roots? Explain.

\subsubsection{Answer}
\label{sec:org999a5b0}
Since Scheme uses the applicative-order evaluation as mentioned and new-if is a procedure,
the operands will be evaluated first, so \texttt{(sqrt-iter guess x)} evaluates \texttt{guess} and \texttt{x} first.
By doing this,
\begin{verbatim}
(new-if (good-enough? guess x)
        guess
        (sqrt-iter (improve guess x) x)))
\end{verbatim}
from \texttt{good-enough?} evaluates \texttt{guess x} first. Also an operand which is the parent procedure itself there
calls recursively, which creates an infinite recursion because it calls itself every time \texttt{new-if} is called,
which is its procedure.

\subsection{Exercise 1.7}
\label{sec:org0cd07b2}
\subsubsection{Question}
\label{sec:org3d211e2}
The good-enough? test used in computing
square roots will not be very effective for finding the square
roots of very small numbers. Also, in real computers,
arithmetic operations are almost always performed with limited precision.
This makes our test inadequate for very large
numbers. Explain these statements, with examples showing
how the test fails for small and large numbers. An alternative
strategy for implementing \texttt{good-enough?} is to watch
how guess changes from one iteration to the next and to
stop when the change is a very small fraction of the guess.
Design a square-root procedure that uses this kind of end
test. Does this work better for small and large numbers?

\subsubsection{Answer}
\label{sec:org896f877}
Based on the example in computing square roots:
\begin{verbatim}
(define (sqrt-iter guess x)
  (if (good-enough? guess x)
      guess
      (sqrt-iter (improve guess x) x)))

(define (improve guess x)
  (average guess (/ x guess)))

(define (average x y)
  (/ (+ x y) 2))

(define (good-enough? guess x)
  (< (abs (- (square guess)
             x))
     0.001))

(define (sqrt x)
  (sqrt-iter 1.0 x))
\end{verbatim}
For small numbers, the function works as intended as shown:
\begin{verbatim}
(sqrt 9)
\end{verbatim}

\begin{verbatim}
3.00009155413138
\end{verbatim}

However, large numbers like the one shown below:
\begin{verbatim}
(sqrt 12345678901234)
\end{verbatim}
does not work properly, as the program appears to never end when evaluated.
An alternative strategy for \texttt{good-enough} as mentioned would be to stop when the change is a very small fraction of \texttt{guess}.
\begin{verbatim}
(define (good-enough? guess x)
  (< (abs (- guess
             (improve guess x)))
     (/ guess 1000000)))
\end{verbatim}
Using the new function, the program evaluates properly as shown:
\begin{verbatim}
(sqrt 12345678901234)
\end{verbatim}

\begin{verbatim}
3513641.86446291
\end{verbatim}

\subsection{Exercise 1.8}
\label{sec:orgb897e9f}
\subsubsection{Question}
\label{sec:org57846d0}
Newton’s method for cube roots is based on
the fact that if y is an approximation to the cube root of x,
then a better approximation is given by the value
$$
\frac{x/y^2 + 2y}{3}.
$$
Use this formula to implement a cube-root procedure analogous
to the square-root procedure. (In Section 1.3.4 we will
see how to implement Newton’s method in general as an
abstraction of these square-root and cube-root procedures.)

\subsubsection{Answer}
\label{sec:orga563086}
The formula is implemented into \texttt{cbrt-improve} where \(y\) becomes \texttt{guess} and \(x\) becomes the desired number to evaluate.
\begin{verbatim}
(define (cbrt-improve guess x)
  (/ (+ (/ x
           (square guess))
        (* 2 guess))
     3))
\end{verbatim}
Then these are the correspondent functions for it:
\begin{verbatim}
(define (cbrt-iter guess x)
  (if (cbrt-good-enough? guess x)
      guess
      (cbrt-iter (cbrt-improve guess x) x)))

(define (cbrt-good-enough? guess x)
  (< (abs (- guess
             (cbrt-improve guess x)))
     (/ guess 1000000)))

(define (cbrt x)
  (cbrt-iter 1.0 x))
\end{verbatim}
The result of the functions is shown below for the cube root of 64:
\begin{verbatim}
(cbrt 64)
\end{verbatim}

\begin{verbatim}
4.000000000076121
\end{verbatim}
\end{document}